{
  "spells": [
    {
      "name": "Arc Spark",
      "level": "Cantrip",
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Wizard", "Warlock"],
      "description": "You unleash a bolt of energy crackling with draconic power toward a creature you can see within range. Make a ranged spell attack. On a hit, the target takes 1d8 damage of a type of your choice: fire, cold, lightning, poison, radiant, necrotic, thunder, psychic, or acid. After the initial hit, the spark arcs to another creature of your choice within 10 feet of the first target, making a separate ranged spell attack for 1d8 of the same damage type.\n\nThe spell bounces additional times when you reach higher levels: two bounces at 5th level, three bounces at 11th level, and bounces beams at 17th level."
    },
    {
      "name": "Biting Briar",
      "level": "Cantrip",
      "school": "Conjuration",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Druid"],
      "description": "You summon sharp, enchanted leaves that whirl toward a creature within range, dealing 1d8 slashing damage. For each melee attack the target performs before the start of your next turn, they take 1d4 piercing damage as the briars dig into them.\n\nAt higher levels: The spell's damage increases to 2d8 at 5th level, 3d8 at 11th level, and 4d8 at 17th level."
    },
    {
      "name": "Black Mist",
      "level": "Cantrip",
      "school": "Necromancy",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Warlock", "Wizard"],
      "description": "You conjure a swirling mass of dark mist that briefly clouds a creature's senses. Choose one creature within range. The target must make a Constitution saving throw. On a failed save, it takes 1d6 necrotic damage, and the next time it makes an attack roll before the end of its next turn, it must roll a d6 and subtract the result from its roll.\n\nAt Higher Levels: The spell's damage increases by 1d6 at 5th level (2d6), 11th level (3d6), and 17th level (4d6)."
    },
    {
      "name": "Frigid Grasp",
      "level": "Cantrip",
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Touch",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Wizard", "Warlock"],
      "description": "You channel the biting cold of the tundra into your hand and reach out to freeze your enemy. Make a melee spell attack against a creature within your reach. On a hit, the target takes 1d8 cold damage. If the target provokes an opportunity attack before the start of your next turn, then the attack deals an additional 1d10 cold damage, and the spell ends.\n\nAt 5th level, the melee attack deals an extra 1d8 cold damage to the target on a hit (2d8), and the damage the target takes for moving increases to 2d10. Both damage rolls increase at 11th level (3d8 and 3d10) and again at 17th level (4d8 and 4d10)."
    },
    {
      "name": "Feral Bond",
      "level": "Cantrip",
      "school": "Transmutation",
      "casting_time": "1 bonus action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "1 minute",
      "classes": ["Sorcerer", "Wizard", "Druid"],
      "description": "You forge a temporary bond with a beast you can see within range that has an Intelligence of 3 or lower. The target gains advantage on its next attack roll before the spell ends, and its movement speed increases by 10 feet until the start of your next turn.\n\nAt Higher Levels: The movement speed bonus increases by 5 feet at 5th level (15 feet), 11th level (20 feet), and 17th level (25 feet)."
    },
    {
      "name": "Moon Pulse",
      "level": "Cantrip",
      "school": "Abjuration",
      "casting_time": "1 action",
      "range": "Self (10-foot radius)",
      "components": "V, S",
      "duration": "1 round",
      "classes": ["Druid", "Cleric"],
      "description": "You channel the protective glow of the moon, granting a brief surge of vitality. You and any allies within 10 feet of you gain 1d4 temporary hit points until the start of your next turn.\n\nAt Higher Levels: The temporary hit points increase to 2d4 at 11th level, and 3d4 at 17th level."
    },
    {
      "name": "Rake",
      "level": "Cantrip",
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "Self (5-foot)",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Druid", "Sorcerer"],
      "description": "You lash out with a powerful slashing attack. Make a melee spell attack against a creature within range. On a hit, the target takes 1d8 slashing damage and is inflicted with Ravaged Flesh. A creature affected by Ravaged Flesh has disadvantage on the next Strength (Athletics) or Dexterity (Acrobatics) check they make before the start of your next turn.\n\nAt Higher Levels: The damage increases by 1d8 at 5th, 11th, and 17th level."
    },
    {
      "name": "Sea Spray",
      "level": "Cantrip",
      "school": "Conjuration",
      "casting_time": "1 action",
      "range": "15 feet (Cone)",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Wizard", "Druid"],
      "description": "You conjure a burst of salty sea spray, drenching creatures in a 15-foot cone in front of you. Each creature in the area must succeed on a Dexterity saving throw or take 1d4 cold damage and have disadvantage on the next attack roll it makes before the end of its next turn. The cool water also extinguishes non-magical flames within the area.\n\nAt Higher Levels: The damage increases to 2d4 at 5th level, 3d4 at 11th, and 4d4 at 17th."
    },
    {
      "name": "Starshine",
      "level": "Cantrip",
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Wizard", "Druid"],
      "description": "You evoke a mote of light from the night sky, conjuring a beam of radiant starlight to strike a creature within range. The target takes 1d8 radiant damage, and the light lingers faintly on the target until the end of your next turn, shedding dim light in a 15-foot radius.\n\nAt Higher Levels: At 5th level, the damage increases to 2d8, at 11th to 3d8, and at 17th to 4d8."
    },
    {
      "name": "Aqua Shield",
      "level": 1,
      "school": "Abjuration",
      "casting_time": "1 bonus action",
      "range": "self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Shaman", "Wizard", "Druid"],
      "description": "You conjure a shimmering barrier of water that surrounds you, offering protection against attacks. Until the spell ends, you gain a +2 bonus to AC and resistance to fire damage. The watery shield ripples with every attack absorbed, and while it remains, you also gain the ability to breathe underwater.\n\nAs a reaction when you take damage from an attack, you can cause the Aqua Shield to burst outward, releasing a splash of water that douses flames within 5 feet of you and imposes disadvantage on the attack roll of the creature that triggered the reaction. This ends the spell immediately."
    },
    {
      "name": "Bend Fate",
      "level": 1,
      "school": "Enchantment",
      "casting_time": "1 reaction",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Wizard"],
      "description": "You reach into the threads of destiny, altering the flow of events to turn failure into success. When a creature within range misses with an attack roll, you can use your reaction to change that miss into a hit. The attack hits as if it had rolled the minimum necessary value to succeed.\n\nIf the attack is a critical hit, this spell does not change the outcome of the critical hit, but you may use this feature to still ensure it hits if the initial roll would have missed."
    },
    {
      "name": "Arcane Charge",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Wizard", "Warlock"],
      "description": "You channel arcane energy into your weapon, imbuing it with magical power. For the duration, your melee weapon attacks deal an additional 1d4 force damage on a hit.\n\nOnce per turn when you hit a creature with a melee weapon attack while this spell is active, you can choose to push the target up to 10 feet away from you in a straight line.\n\nWhen you cast this spell using a spell slot of 3rd or 4th level, the extra damage increases to 2d4. When you use a spell slot of 5th or 6th level, the extra damage increased to 3d4. When you use a spell slot of 7th level or higher, the extra damage increases to 4d4."
    },
    {
      "name": "Earthen Grasp",
      "level": 1,
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a small piece of clay)",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Shaman", "Wizard", "Druid"],
      "description": "You cause a hand made of compacted earth to rise from the ground at a point within range. Choose one creature within 5 feet of that point to make a Strength saving throw. On a failed save, the target takes 1d8 bludgeoning damage and is restrained by the earthen hand for the spell's duration.\n\nWhile restrained in this way, the creature can use its action to make a Strength check against your spell save DC. On a success, it frees itself and the spell ends.\n\nThe hand is considered Large and has AC 12 with hit points equal to twice your spellcasting ability modifier. It is immune to poison and psychic damage. The hand crumbles and the spell ends early if it is reduced to 0 hit points.\n\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the bludgeoning damage increases by 1d8 for each slot level above 1st."
    },
    {
      "name": "Moonlit Triad",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self (10-foot radius)",
      "components": "S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Shaman", "Cleric", "Druid"],
      "description": "You invoke the power of Avanté's three moons to imbue yourself with a mystical aura. Choose one of the following effects when you cast the spell. The aura affects you and creatures of your choice within 10 feet:\n\nSelith's Protection: The aura grants temporary hit points equal to your spellcasting ability modifier + 1 to all creatures initially stood within it when cast. While this effect is active, creatures of your choice within the radius are immune to being frightened.\nNytheris's Shroud: Shadows envelop you, granting you and friendly creatures within range advantage on Dexterity (Stealth) checks and half cover against ranged attacks. The aura shifts and darkens, blending you with the shadows.\nTethys's Inspiration: Starlit sparkles surround you, allowing you to grant advantage on the next attack roll you or a creature in the aura makes. Can only affect one creature per turn."
    },
    {
      "name": "Rock Shard",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "20 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Shaman", "Druid"],
      "description": "You stomp the ground, causing a jagged shard of rock to break free and fly toward a target within range. Choose one creature within range; the target must succeed on a Dexterity saving throw or take 3d8 bludgeoning damage. On a successful save, the target takes half as much damage.\n\nIf the surface beneath you is made of earth, stone, or a similar material, you also create difficult terrain in a 10-foot radius around the point of impact, as small fragments scatter around. This terrain remains until cleared, but does not affect you.\n\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the bludgeoning damage increases by 1d8 for each slot level above 1st."
    },
    {
      "name": "Searspike",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Wizard", "Warlock"],
      "description": "You conjure a blazing spike of flame behind a creature within range, lancing through them with searing heat. The target must make a Constitution saving throw. On a failed save, the target takes 2d6 fire damage and suffers disadvantage on their next attack roll until the end of their next turn. On a successful save, the target takes half as much damage and suffers no further effects.\n\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the initial fire damage increases by 1d6 for each slot level above 1st."
    },
    {
      "name": "Stargaze",
      "level": 1,
      "school": "Divination",
      "casting_time": "1 minute",
      "range": "self",
      "components": "V, S, M (a small crystal or glass lens)",
      "duration": "Instantaneous",
      "classes": ["Shaman", "Wizard", "Druid", "Cleric"],
      "description": "You take a moment to look at the night sky and interpret the positions of the stars and moons. When you cast this spell under a clear sky, you gain a sense of your precise location, relative to the nearest known landmarks or settlements, and you become aware of the direction of true north. If you are within a well-mapped region, you can even gain a rough estimation of the distance to the nearest settlement or significant geographic feature.\n\nAdditionally, this spell grants you advantage on Wisdom (Survival) checks made to navigate for the next hour.\n\nThis spell does not work if the sky is obscured, such as by heavy clouds, magical effects, or other obstructions."
    },
    {
      "name": "Torrent Burst",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a small vial of water)",
      "duration": "Instantaneous",
      "classes": ["Shaman", "Wizard", "Druid"],
      "description": "You summon a concentrated jet of water and hurl it toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d6 bludgeoning damage, and must succeed on a Strength saving throw or be pushed up to 10 feet away from you.\n\nIf the target is a creature composed of fire or is currently aflame, it has disadvantage on the saving throw and takes an additional 1d6 cold damage as the water extinguishes flames.\n\nAt Higher Levels: When you cast this spell using a spell slot of 2nd level or higher, the bludgeoning damage increases by 1d6 for each slot level above 1st."
    },
    {
      "name": "Veil of Refraction",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self",
      "components": "S",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["Paladin", "Cleric", "Wizard"],
      "description": "You call upon your divine oath to cloak yourself in a shadowy aura that aids your stealth and fortifies your resolve. For the duration, you gain the following benefits:\n\nYou are heavily obscured to creatures more than 10 feet away from you, blending into shadows as divine energy shrouds your form.\nYour movement makes no sound, granting you advantage on Dexterity (Stealth) checks for the duration.\nOnce during the spell's duration, you can imbue your weapon with radiant energy. When you make an attack from stealth, you can add 1d6 radiant damage to your weapon attack, which also deals an extra 1d6 psychic damage if the target is evil-aligned.\nThis spell ends early if you make an attack without using the bonus radiant damage, if you are struck by an attack, or if you willingly end it."
    },
    {
      "name": "Ward of Reflection",
      "level": 1,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin", "Wizard", "Cleric"],
      "description": "You infuse yourself with arcane energy, bolstering your defenses while preparing to strike back at your foes. For the duration, you gain a +1 bonus to AC.\n\nAdditionally, once per turn when a creature within 5 feet of you misses you with a melee attack, you can use your reaction to make a melee weapon attack against that creature."
    },
    {
      "name": "Aquatic Adaptation",
      "level": 2,
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "Touch",
      "components": "V, S, M (a piece of seaweed or coral)",
      "duration": "10 Minutes",
      "classes": ["Shaman", "Druid"],
      "description": "You touch up to three willing creatures (including yourself), and each creature gains the following benefits for the duration:\n\nThe ability to breathe underwater.\nA swimming speed equal to their walking speed.\nEnhanced vision underwater, allowing them to see clearly in both murky and clear water up to a range of 60 feet.\nIf a creature affected by this spell is swimming in water, they have advantage on Dexterity (Stealth) checks made to hide in that environment, as their movements blend more naturally with the water around them.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, you can target one additional creature for each slot level above 2nd."
    },
    {
      "name": "Glass Blade",
      "level": 2,
      "school": "Conjuration",
      "casting_time": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Warlock", "Ranger"],
      "description": "You summon a spectral weapon in your hand, composed of divine energy. The weapon takes the form of any melee weapon you are proficient with, glowing faintly with an ethereal light that fades into nothingness upon impact. The weapon vanishes after a single attack, leaving no mark or trace.\n\nWhen you make an attack with the Glass Blade, you gain advantage on the attack roll. On a hit, the weapon deals 3d8 radiant damage, and the target must succeed on a Constitution saving throw against your spell save DC or be silenced until the end of their next turn, unable to make any sound.\n\nThe weapon then vanishes completely, leaving no trace of its existence, and no visible wounds on the target's body. If the attack misses, the weapon dissipates without effect.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd."
    },
    {
      "name": "Primal Pounce",
      "level": 2,
      "school": "Transmutation",
      "casting_time": "1 bonus action",
      "range": "self",
      "components": "V, S",
      "duration": "instantaneous",
      "classes": ["Druid", "Ranger"],
      "description": "You channel the agility and ferocity of a predator, allowing you to leap and strike with primal force. When you cast this spell, you leap up to 20 feet in any direction. This movement does not provoke opportunity attacks. At the end of your leap, make a melee spell attack against a creature within 5 feet of where you land.\n\nOn a hit, the target takes 2d6 piercing, slashing, or bludgeoning damage (your choice), and must succeed on a Strength saving throw (DC = 8 + your proficiency bonus + your Wisdom modifier) or be knocked prone.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd."
    },
    {
      "name": "Radiant Dawn",
      "level": 2,
      "school": "Evocation",
      "casting_time": "1 bonus action",
      "range": "Self (10-foot radius)",
      "components": "V",
      "duration": "instantaneous",
      "classes": ["Cleric", "Paladin"],
      "description": "A burst of radiant light erupts from you, affecting all creatures within a 10-foot radius. Each creature within range is either healed or damaged depending on their alignment with you.\n\nAllies: Each allied creature within the area regains 1d6 hit points.\nEnemies: Each chosen enemy must make a Constitution saving throw. On a failed save, they take 1d6 radiant damage and are blinded until the start of your next turn. On a successful save, they take half damage and are not blinded.\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the healing and damage increase by 1d6 for each slot level above 2nd."
    },
    {
      "name": "Scree Bind",
      "level": 2,
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a small shard of stone or metal)",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Druid", "Wizard"],
      "description": "You call forth loose stones, debris, and nearby materials to surge forward, wrapping around a target creature and binding them to a nearby solid surface. Choose a creature within range. The target must succeed on a Dexterity saving throw or be bound by the grasping materials and hurled up to 10 feet into a wall, tree, or another sturdy surface, where it becomes restrained. If no suitable surface exists, the creature is only restrained in place.\n\nWhile restrained by this spell, the target can use its action to make a Strength (Athletics) or Dexterity (Acrobatics) check (target's choice) against your spell save DC. On a success, it frees itself from the bindings and the spell ends.\n\nThe bound creature takes 1d8 bludgeoning damage upon being thrown into the surface. If there is no surface, the creature does not take damage but is still restrained by the grasping materials.\n\nAt Higher Levels. When you cast this spell using a spell slot of 3rd level or higher, the bludgeoning damage increases by 1d8 for each slot level above 2nd."
    },
    {
      "name": "Twilight Barricade",
      "level": 2,
      "school": "Abjuration",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Concentration, up to 10 minutes",
      "classes": ["Paladin", "Cleric", "Sorcerer"],
      "description": "You conjure a barrier of shimmering twilight, a semi-transparent wall of protective energy that stands between you and your enemies. Choose a point within range to create a barricade of dim, flickering light. The barricade is 10 feet long, 10 feet high, and 1 foot thick, and it provides half-cover to those behind it. The barricade can be placed vertically or horizontally, such as creating a protective wall or a platform across difficult terrain.\n\nCreatures behind the Twilight Barricade gain temporary hit points equal to your spellcasting ability modifier at the start of each of their turns while the barricade is active. These temporary hit points fade at the end of the creature's turn if not used. The barricade also provides advantage on Stealth checks for creatures hiding in its shadow, as the flickering twilight obscures their movements.\n\nThe barricade blocks line of sight, but creatures and attacks can pass through it. However, any creature attempting to move through the barricade must make a Constitution saving throw or become blinded until the end of their next turn due to the disorienting effect of the twilight energy.\n\nThe barricade vanishes if dispelled, if your concentration is broken, or if the spell's duration ends.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the length of the barricade increases by 10 feet for each slot level above 2nd."
    },
    {
      "name": "Valiant Smite",
      "level": 2,
      "school": "Evocation",
      "casting_time": "1 bonus action",
      "range": "Self",
      "components": "V",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin"],
      "description": "Your weapon glows with radiant energy, infusing your strikes with the essence of valor. The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with radiant power, and the attack deals an extra 2d6 radiant damage.\n\nAdditionally, when you hit a creature with this smite, choose one ally within 30 feet of you. That ally gains temporary hit points equal to half the radiant damage dealt by the smite.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, the extra radiant damage increases by 1d6 for each slot level above 2nd."
    },
    {
      "name": "Winged Shot",
      "level": 2,
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "Self (30-foot range for ricochet)",
      "components": "V, S, M (a spent bullet casing)",
      "duration": "Instantaneous",
      "classes": ["Artificer", "Warlock", "Wizard"],
      "description": "You fire a specially enchanted bullet that ricochets off surfaces. After making a firearm attack against a target, the bullet can ricochet and strike another target within 30 feet of the original. You make a new attack roll for the ricochet, and if the attack hits, the second target takes half the original damage. The ricochet shot can hit a maximum of two additional targets, with each new target needing to be within 30 feet of the previous one.\n\nAt Higher Levels: When you cast this spell using a spell slot of 3rd level or higher, you can ricochet the shot one additional time for each slot level above 2nd."
    },
    {
      "name": "Divine Reclamation",
      "level": 3,
      "school": "Evocation",
      "casting_time": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin", "Cleric"],
      "description": "You infuse yourself with divine energy that restores your vitality as you vanquish your enemies. For the duration, when you reduce a creature to 0 hit points, you regain hit points equal to your Charisma modifier + your Proficiency Bonus (minimum of 1)."
    },
    {
      "name": "Chance At Redemption",
      "level": 3,
      "school": "Abjuration",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a small token of forgiveness, such as a symbol of faith or a piece of silver worth 10 gp)",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin", "Cleric", "Druid"],
      "description": "You call upon the radiant power of redemption, offering a chance to turn the tide of battle through forgiveness and healing. Choose one creature within range that has recently attacked or harmed you or your allies. The target must succeed on a Wisdom saving throw or be overwhelmed by a moment of clarity, realizing the chance for redemption. On a failed save, the creature is restrained by the weight of its misdeeds until the spell ends, but takes no damage.\n\nIf, during the duration of the spell, the target willingly takes no hostile actions and ends their turn without attacking or harming anyone, they are healed for 3d8 hit points and the restrained effect is lifted. Additionally, if the target is willing to accept the path of redemption, the caster and the target each gain temporary hit points equal to half the caster's level (rounded down).\n\nIf the target chooses to attack during the spell's duration, they take 3d8 radiant damage, and the spell ends immediately.\n\nAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the healing or damage increases by 1d8 for each slot level above 3rd."
    },
    {
      "name": "Swarm Call",
      "level": 3,
      "school": "Conjuration",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S, M (a small handful of natural materials like insect wings, feathers, or fur)",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Druid", "Sorcerer", "Ranger", "Warlock"],
      "description": "You summon an overwhelming presence of swarming creatures or natural phenomena, creating a 20-foot radius sphere centered on a point within range. The swarm is an illusion of creatures of your choice—whether it's a cloud of buzzing insects, flocks of birds, swirling leaves, or even shadowy figures. The presence of the swarm confuses and overwhelms creatures within the area.\n\nWhile the swarm aura persists, all creatures in the area must make a Wisdom saving throw at the start of each of their turns. On a failed save, a creature suffers one of the following effects, which you choose when casting the spell:\n\nThe creature has disadvantage on attack rolls and Dexterity saving throws until the start of its next turn as they are distracted by the chaotic presence.\nThe creature is frightened of the swarm for the duration of the spell. While frightened, the creature must use its movement to move as far away from the swarm's center as possible.\nThe creature's movement speed is halved for the duration of the spell as it struggles to push through or avoid the chaotic mass.\ncreature can repeat the saving throw at the end of each of its turns, ending the effect on a success. Creatures that succeed on their saving throw are unaffected for the rest of the spell's duration.\n\nAt Higher Levels: When you cast this spell using a spell slot of 4th level or higher, the radius of the swarm increases by 5 feet for each slot level above 3rd."
    },
    {
      "name": "Lunar Grasp",
      "level": 3,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self (15-foot radius)",
      "components": "V, S, M (a small silver orb)",
      "duration": "Instantaneous",
      "classes": ["Sorcerer", "Cleric", "Druid"],
      "description": "You summon the gravitational power of the moons, creating a surge of force that pulls enemies toward you while bombarding them with lunar energy. Each creature of your choice within a 15-foot radius must make a Strength saving throw. On a failed save, the creatures are pulled up to 10 feet toward you, and they take 3d8 force damage. On a successful save, they take half as much damage and are not pulled.\n\nIf a creature is pulled adjacent to you, they take an additional 1d8 radiant damage as the lunar energy intensifies around them.\n\nAt Higher Levels. When you cast this spell using a spell slot of 4th level or higher, the force damage increases by 1d8 for each slot level above 3rd."
    },
    {
      "name": "Grudge Strike",
      "level": 3,
      "school": "Transmutation",
      "casting_time": "1 bonus action",
      "range": "Self",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Ranger", "Paladin", "Wizard"],
      "description": "Your weapon thirsts for vengeance, striking back at those who harm you. For the duration of the spell, whenever a creature hits you with an attack, your next weapon attack against that creature deals an additional 1d10 force damage. This extra damage can only be applied to the first attack you make against the creature each turn. Additionally, the target's movement speed is reduced by 10 feet until the start of your next turn.\n\nAt Higher Levels: When you cast this spell using a spell slot of 5th level, 7th level, or 9th level, the damage increases by 1d10 for each of those spell slot levels above 3rd."
    },
    {
      "name": "Ash Rain",
      "level": 4,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "120 feet",
      "components": "V, S, M (a pinch of ash)",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin", "Cleric", "Druid"],
      "description": "You conjure a dark cloud overhead that rains down searing ash over a 20-foot-radius area within range. The ash causes enemies to suffer burning pain while bolstering the resilience of your allies.\n\nCreatures of your choice that start their turn in the area or enter it for the first time on a turn must make a Dexterity saving throw. On a failed save, they take 2d8 fire damage and have their speed reduced by 10 feet for as long as they remain in the area. On a successful save, they take half as much damage and suffer no speed reduction.\n\nFriendly creatures within the area gain resistance to fire damage and receive temporary hit points equal to your spellcasting ability modifier at the start of each of their turns as long as they remain in the area.\n\nAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the fire damage increases by 1d8 for each slot level above 4th."
    },
    {
      "name": "Intercession",
      "level": 4,
      "school": "Abjuration",
      "casting_time": "1 reaction, which you take when an ally within range is targeted by an attack or harmful spell",
      "range": "30 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Paladin", "Cleric"],
      "description": "Upon seeing an ally in danger, you call upon your heroic power, dashing toward them to shield them from harm. When you cast Intercession, you can move up to 30 feet toward an ally within range. If you reach them before the attack or spell is resolved, you impose disadvantage on the incoming attack roll or grant your ally Advantage on their saving throw.\n\nIf you successfully protect the ally, you and the ally both gain a +2 bonus to AC until the start of your next turn, as the heroic energy empowers both of you to stand firm in the face of danger.\n\nAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the AC bonus increases by +1 for each slot level above 4th."
    },
    {
      "name": "City's Grasp",
      "level": 4,
      "school": "Conjuration",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Wizard", "Sorcerer", "Artificer"],
      "description": "You call upon the urban landscape to ensnare your enemies. In a 20-foot-radius centered on a point you choose within range, the structures of the city—such as cobblestones, iron grates, lamp posts, and even debris—animate and lash out to restrain those in the area.\n\nEach creature in the area must make a Dexterity saving throw. On a failed save, the creature is restrained by the city's grasp for the duration. A creature restrained by the spell can use its action to make a Strength (Athletics) or Dexterity (Acrobatics) check against your spell save DC. On a success, the creature frees itself.\n\nWhile restrained by the spell, creatures take 2d8 bludgeoning damage at the start of each of their turns, as the structures of the city crush and squeeze them.\n\nIf the spell is cast in an area with no urban elements, such as open wilderness, the spell fails.\n\nAt Higher Levels. When you cast this spell using a spell slot of 5th level or higher, the bludgeoning damage increases by 1d8 for each slot level above 4th."
    },
    {
      "name": "Bullet Storm",
      "level": 4,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "Self (15-foot cone)",
      "components": "V, S, M (a handful of bullets)",
      "duration": "Instantaneous",
      "classes": ["Wizard", "Sorcerer", "Artificer"],
      "description": "You unleash a hail of magical bullets in a 15-foot cone. Each creature in the cone must make a Dexterity saving throw. A creature takes 6d6 piercing damage on a failed save, or half as much on a successful one. The bullets are considered magical for the purposes of overcoming resistance and immunity.\n\nAt Higher Levels: When you cast this spell using a spell slot of 5th level or higher, the damage increases by 2d6 for each slot level above 4th."
    },
    {
      "name": "Crescent Blade",
      "level": 5,
      "school": "Evocation",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Instantaneous",
      "classes": ["Ranger", "Cleric"],
      "description": "You conjure a radiant, crescent-shaped blade of pure light that sweeps forward in a 60-foot-long, 10-foot-wide arc. Each creature in the line must make a Dexterity saving throw. On a failed save, a creature takes 6d8 radiant damage as the blade strikes them. On a successful save, a creature takes half damage.\n\nAfter reaching its maximum range, the crescent blade returns along the same path. Instead of dealing damage on the return, the blade pulls all creatures that failed the initial Dexterity saving throw 10 feet toward you. These creatures must then succeed on a Strength saving throw or be knocked prone. Creatures that succeeded on the initial Dexterity save are unaffected by the return effect.\n\nAt Higher Levels. When you cast this spell using a spell slot of 6th level or higher, the damage of the first pass increases by 2d8 for each slot level above 5th."
    },
    {
      "name": "Shroud of Silence",
      "level": 5,
      "school": "Illusion",
      "casting_time": "1 action",
      "range": "60 feet",
      "components": "V, S",
      "duration": "Concentration, up to 1 minute",
      "classes": ["Paladin", "Ranger", "Warlock"],
      "description": "You envelop a target within range in a cone of deep silence and dim shadow, isolating them from the world around them. Choose one creature within range. The target must succeed on a Wisdom saving throw or be blinded and deafened for the duration. While affected, they are unable to hear any sound or see any creatures, including you. They have disadvantage on all saving throws against being frightened and disadvantage on Wisdom (Perception) checks to detect anything around them.\n\nThe target can repeat the saving throw at the end of each of its turns, ending the effect on a success. While under the effect of Shroud of Silence, the target's footsteps and movements make no sound, and any attempts to call for help go unheard.\n\nAny attack that hits the creature is a critical hit if the attacker is within 5 feet of the creature. Any attacks they receive during Shroud of Silence allow them to repeat the saving throw again, but this time at disadvantage\n\nAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, you can target one additional creature for each slot level above 5th."
    },
    {
      "name": "Eventide Casket",
      "level": 5,
      "school": "Abjuration",
      "casting_time": "1 action",
      "range": "30 feet",
      "components": "V, S, M (a shard of crystal or polished stone)",
      "duration": "1 turn",
      "classes": ["Paladin", "Ranger", "Warlock"],
      "description": "You encase an ally in a shimmering, dark-hued barrier of twilight energy that both protects and retaliates. Choose one creature within range. That creature gains temporary hit points equal to 3d12 + your spellcasting ability modifier. These temporary hit points last until the start of your next turn.\n\nIf the temporary hit points are depleted before the start of your next turn, the Eventide Casket shatters in a brilliant explosion of twilight energy, damaging all enemies within a 15-foot radius of the target. Each creature in that area must make a Dexterity saving throw. On a failed save, creatures take 4d8 force damage and are pushed 10 feet away from the target. On a successful save, creatures take half as much damage and aren't pushed.\n\nIf the temporary hit points last until the start of your next turn without being broken, the Eventide Casket fades without exploding.\n\nAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the temporary hit points increase by 1d12 for each slot level above 5th."
    },
    {
      "name": "Vital Precision",
      "level": 5,
      "school": "Transmutation",
      "casting_time": "1 action",
      "range": "Self",
      "components": "V, S",
      "duration": "1 turn",
      "classes": ["Artificer", "Ranger", "Wizard"],
      "description": "You hone your focus and magical precision, turning your shots into devastatingly accurate attacks. For the duration, you score a critical hit on a roll of 19 or 20 with firearm attacks, and your firearm attacks deal an additional 2d6 damage on a hit.\n\nAt Higher Levels: When you cast this spell using a spell slot of 6th level or higher, the extra damage increases by 1d6 for each slot level above 5th."
    }
  ]
}
